TexasInstruments/matter/ti_examples/lighting-app/cc13x4_26x4/src/AppTask.cpp
void CancelTimer(void)
{
    if (xTimerStop(sOTAInitTimer, 0) == pdFAIL)
    {
        PLAT_LOG("sOTAInitTimer stop() failed");
    }
}

void AppTask::ActionInitiated(LightingManager::Action_t aAction, int32_t aActor)
{
    if (aAction == LightingManager::ON_ACTION)
    {
        uiTurnOn();
    }
    else if (aAction == LightingManager::OFF_ACTION)
    {
        uiTurnOff();
    }
}

void AppTask::ActionCompleted(LightingManager::Action_t aAction)
{
    PLAT_LOG("Lighting Action completed Callback");
#ifdef TI_APPOBLE_ENABLE
    BLE_CONNECTION_OBJECT conId;
    uint8_t lightstate;

    /* Obtain first connection handle */
    conId = AppoBLE().AppoBLE_GetValidConnection(1);

    if (conId != NULL)
    {
        PLAT_LOG("First Active Connection ID: %d", *((uint16_t *) conId));
    }
#endif
    if (aAction == LightingManager::ON_ACTION)
    {
        uiTurnedOn();
#ifdef TI_APPOBLE_ENABLE
        lightstate = 1;
        AppoBLE().SendAppoBLEWriteRequest(conId, (ChipBleUUID *) LightServiceServUUID, (ChipBleUUID *) LightServiceLightStateUUID,
                                          &lightstate, sizeof(lightstate));
#endif
    }
    else if (aAction == LightingManager::OFF_ACTION)
    {
        uiTurnedOff();
#ifdef TI_APPOBLE_ENABLE
        lightstate = 0;
        AppoBLE().SendAppoBLEWriteRequest(conId, (ChipBleUUID *) LightServiceServUUID, (ChipBleUUID *) LightServiceLightStateUUID,
                                          &lightstate, sizeof(lightstate));
#endif
    }
}

void AppTask::PostEvent(const AppEvent * aEvent)
{
    if (sAppEventQueue != NULL)
    {
        BaseType_t status;
        if (xPortIsInsideInterrupt())
        {
            BaseType_t higherPrioTaskWoken = pdFALSE;
            status                         = xQueueSendFromISR(sAppEventQueue, aEvent, &higherPrioTaskWoken);

#ifdef portYIELD_FROM_ISR
            portYIELD_FROM_ISR(higherPrioTaskWoken);
#elif portEND_SWITCHING_ISR // portYIELD_FROM_ISR or portEND_SWITCHING_ISR
            portEND_SWITCHING_ISR(higherPrioTaskWoken);
#else                       // portYIELD_FROM_ISR or portEND_SWITCHING_ISR
#error "Must have portYIELD_FROM_ISR or portEND_SWITCHING_ISR"
#endif // portYIELD_FROM_ISR or portEND_SWITCHING_ISR
        }
        else
        {
            status = xQueueSend(sAppEventQueue, aEvent, 1);
        }

        if (status != pdTRUE)
        {
            PLAT_LOG("Failed to post event to app task event queue");
        }
    }
    else
    {
        PLAT_LOG("Event Queue is NULL should never happen");
    }
}

void AppTask::DispatchEvent(AppEvent * aEvent)
{
    int32_t actor;
    PLAT_LOG("DispatchEvent Entry");

    switch (aEvent->Type)
    {
    case AppEvent::kEventType_Light: {
        actor = aEvent->LightEvent.Actor;
        LightMgr().IsLightOn() ? LightMgr().InitiateAction(actor, LightingManager::OFF_ACTION)
                               : LightMgr().InitiateAction(actor, LightingManager::ON_ACTION);
    }
    case AppEvent::kEventType_ButtonLeft:
        if (AppEvent::kAppEventButtonType_Clicked == aEvent->ButtonEvent.Type)
        {
            actor = AppEvent::kEventType_ButtonLeft;
            PLAT_LOG("DispatchEvent Entry on action");

            LightMgr().InitiateAction(actor, LightingManager::ON_ACTION);
        }
        else if (AppEvent::kAppEventButtonType_LongClicked == aEvent->ButtonEvent.Type)
        {
#ifdef TI_APPOBLE_ENABLE
            if (AppoBLE().ScheduleAppoBLEFxn(eraseAllBonds, NULL) == SUCCESS)
            {
                PLAT_LOG("Successfully scheduled custom function");
            }
#endif
            chip::Server::GetInstance().ScheduleFactoryReset();
        }
        break;

    case AppEvent::kEventType_ButtonRight:
        if (AppEvent::kAppEventButtonType_Clicked == aEvent->ButtonEvent.Type)
        {
            actor = AppEvent::kEventType_ButtonRight;
            PLAT_LOG("DispatchEvent Entry off action");

            LightMgr().InitiateAction(actor, LightingManager::OFF_ACTION);
        }
        else if (AppEvent::kAppEventButtonType_LongClicked == aEvent->ButtonEvent.Type)
        {
            // Enable BLE advertisements
            if (!ConnectivityMgr().IsBLEAdvertisingEnabled())
            {
                if (Server::GetInstance().GetCommissioningWindowManager().OpenBasicCommissioningWindow() == CHIP_NO_ERROR)
                {
                    PLAT_LOG("Enabled BLE Advertisements");
                }
                else
                {
                    PLAT_LOG("OpenBasicCommissioningWindow() failed");
                }
            }
            else
            {
                // Disable BLE advertisements
                ConnectivityMgr().SetBLEAdvertisingEnabled(false);
                PLAT_LOG("Disabled BLE Advertisements");
            }
        }
        break;

    case AppEvent::kEventType_IdentifyStart:
        switch (identify_trigger_effect)
        {
        case IDENTIFY_TRIGGER_EFFECT_BLINK:
            identify_TakeAction();
            break;
        case IDENTIFY_TRIGGER_EFFECT_BREATHE:
            identify_TakeAction();
            break;
        case IDENTIFY_TRIGGER_EFFECT_OKAY:
            identify_TakeAction();
            break;
        default:
            break;
        }
        PLAT_LOG("Identify started");
        break;

    case AppEvent::kEventType_Identify:
        // blink LED
        PLAT_LOG("Identify cmd received, will blink green led three times now");
#if (LED_ENABLE == 1)
        LED_startBlinking(sAppGreenHandle, 250, 3);
#endif
        break;

    case AppEvent::kEventType_IdentifyStop:
        identify_StopAction();
        PLAT_LOG("Identify stopped");
        break;

    case AppEvent::kEventType_AppEvent:
        if (NULL != aEvent->Handler)
        {
            aEvent->Handler(aEvent);
        }
        break;
#ifdef TI_APPOBLE_ENABLE
    case AppEvent::kEventType_Diagnostic_refresh:
        PLAT_LOG("Diagnostics being refreshed");
        AppoBLEDiagRefresh();
        break;

    case AppEvent::kEventType_Diagnostic_timer:
        PLAT_LOG("Periodic diagnostic refresh");
        AppoBLEDiagRefresh();
        break;

    case AppEvent::kEventType_Throughput_Matter_Disable:
        PLAT_LOG("Locking matter and thread");
        matterThreadDisable();
        break;

    case AppEvent::kEventType_Throughput_Matter_Enable:
        PLAT_LOG("Unlocking matter and thread");
        matterThreadEnable();
        break;
    case AppEvent::kEventType_Throughput_calculate:
        if (upstream_flag)
        {
            throughput_calc(&upstream_calc);
        }
        else
        {
            throughput_calc(&downstream_calc);
        }
        break;
#endif
    case AppEvent::kEventType_None:
    default:
        break;
    }
}

