TexasInstruments/matter/ti_examples/lighting-app/cc13x4_26x4/src/AppTask.cpp
void AppTask::IdentifyStartHandler(::Identify *)
{
    AppEvent event;
    event.Type = AppEvent::kEventType_IdentifyStart;
    sAppTask.PostEvent(&event);
}

void AppTask::IdentifyStopHandler(::Identify *)
{
    AppEvent event;
    event.Type = AppEvent::kEventType_IdentifyStop;
    sAppTask.PostEvent(&event);
}

void AppTask::TriggerIdentifyEffectHandler(::Identify * identify)
{
    switch (identify->mCurrentEffectIdentifier)
    {
    case Clusters::Identify::EffectIdentifierEnum::kBlink:
        PLAT_LOG("Starting blink identifier effect");
        identify_trigger_effect = IDENTIFY_TRIGGER_EFFECT_BLINK;
        IdentifyStartHandler(identify);
        break;
    case Clusters::Identify::EffectIdentifierEnum::kBreathe:
        PLAT_LOG("Starting breathe identifier effect");
        identify_trigger_effect = IDENTIFY_TRIGGER_EFFECT_BREATHE;
        IdentifyStartHandler(identify);
        break;
    case Clusters::Identify::EffectIdentifierEnum::kOkay:
        PLAT_LOG("Starting okay identifier effect");
        identify_trigger_effect = IDENTIFY_TRIGGER_EFFECT_OKAY;
        IdentifyStartHandler(identify);
        break;
    case Clusters::Identify::EffectIdentifierEnum::kChannelChange:
        PLAT_LOG("Channel Change identifier effect not implemented");
        break;
    case Clusters::Identify::EffectIdentifierEnum::kFinishEffect:
        PLAT_LOG("Finish identifier effect");
        identify_trigger_effect = IDENTIFY_TRIGGER_EFFECT_FINISH_STOP;
        IdentifyStopHandler(identify);
        break;
    case Clusters::Identify::EffectIdentifierEnum::kStopEffect:
        PLAT_LOG("Stop identifier effect");
        identify_trigger_effect = IDENTIFY_TRIGGER_EFFECT_FINISH_STOP;
        IdentifyStopHandler(identify);
        break;
    default:
        PLAT_LOG("No identifier effect");
    }
}

// Action initiated callback
void uiTurnOn(void)
{
    PLAT_LOG("Light On initiated");
#if (LED_ENABLE == 1)
    LED_setOn(sAppRedHandle, LED_BRIGHTNESS_MAX);
    LED_startBlinking(sAppRedHandle, 110 /* ms */, LED_BLINK_FOREVER);
#endif // LED_ENABLE
}

// Action completed callback
void uiTurnedOn(void)
{
    PLAT_LOG("Light On completed");
#if (LED_ENABLE == 1)
    LED_stopBlinking(sAppRedHandle);
    LED_setOn(sAppRedHandle, LED_BRIGHTNESS_MAX);
#endif // LED_ENABLE
}

// Action initiated callback
void uiTurnOff(void)
{
    PLAT_LOG("Light Off initiated");
#if (LED_ENABLE == 1)
    LED_setOn(sAppRedHandle, LED_BRIGHTNESS_MAX);
    LED_startBlinking(sAppRedHandle, 110 /* ms */, LED_BLINK_FOREVER);
#endif // LED_ENABLE
}

// Action completed callback
void uiTurnedOff(void)
{
    PLAT_LOG("Light Off completed");
#if (LED_ENABLE == 1)
    LED_stopBlinking(sAppRedHandle);
    LED_setOff(sAppRedHandle);
#endif // LED_ENABLE
}

#if (BUTTON_ENABLE == 1)
void AppTask::ButtonLeftEventHandler(Button_Handle handle, Button_EventMask events)
{
    AppEvent event;
    event.Type = AppEvent::kEventType_ButtonLeft;

    if (events & Button_EV_CLICKED)
    {
        event.ButtonEvent.Type = AppEvent::kAppEventButtonType_Clicked;
    }
    else if (events & Button_EV_LONGCLICKED)
    {
        event.ButtonEvent.Type = AppEvent::kAppEventButtonType_LongClicked;
    }
    // button callbacks are in ISR context
    if (xQueueSendFromISR(sAppEventQueue, &event, NULL) != pdPASS)
    {
        /* Failed to post the message */
    }
}

void AppTask::ButtonRightEventHandler(Button_Handle handle, Button_EventMask events)
{
    AppEvent event;
    event.Type = AppEvent::kEventType_ButtonRight;

    if (events & Button_EV_CLICKED)
    {
        event.ButtonEvent.Type = AppEvent::kAppEventButtonType_Clicked;
    }
    else if (events & Button_EV_LONGCLICKED)
    {
        event.ButtonEvent.Type = AppEvent::kAppEventButtonType_LongClicked;
    }
    // button callbacks are in ISR context
    if (xQueueSendFromISR(sAppEventQueue, &event, NULL) != pdPASS)
    {
        /* Failed to post the message */
    }
}
#endif // BUTTON_ENABLE

void AppTask::uiInit(void)
{
#if (LED_ENABLE == 1)

    LED_Params ledParams;

    // Initialize LEDs
    PLAT_LOG("Initialize LEDs");
    LED_init();

    LED_Params_init(&ledParams); // default PWM LED
    sAppRedHandle = LED_open(CONFIG_LED_RED, &ledParams);
    LED_setOff(sAppRedHandle);

    LED_Params_init(&ledParams); // default PWM LED
    sAppGreenHandle = LED_open(CONFIG_LED_GREEN, &ledParams);
    LED_setOff(sAppGreenHandle);
#endif // LED ENABLE

#if (BUTTON_ENABLE == 1)
    Button_Params buttonParams;

    // Initialize buttons
    PLAT_LOG("Initialize buttons");
    Button_init();

    Button_Params_init(&buttonParams);
    buttonParams.buttonEventMask   = Button_EV_CLICKED | Button_EV_LONGCLICKED;
    buttonParams.longPressDuration = 1000U; // ms
    sAppLeftHandle                 = Button_open(CONFIG_BTN_LEFT, &buttonParams);
    Button_setCallback(sAppLeftHandle, ButtonLeftEventHandler);

    Button_Params_init(&buttonParams);
    buttonParams.buttonEventMask   = Button_EV_CLICKED | Button_EV_LONGCLICKED;
    buttonParams.longPressDuration = 1000U; // ms
    sAppRightHandle                = Button_open(CONFIG_BTN_RIGHT, &buttonParams);
    Button_setCallback(sAppRightHandle, ButtonRightEventHandler);
#endif // BUTTON ENABLE
}
#ifdef TI_APPOBLE_ENABLE

void AppoBLEDiagRefresh(void)
{

    uint16_t panId        = 0;
    uint8_t threadChannel = 0;
    otNetworkKey netKey;
    uint64_t heapFree;
    uint64_t heapUsed;

    BLE_CONNECTION_OBJECT conId;

    /* Obtain first connection handle */
    conId = AppoBLE().AppoBLE_GetValidConnection(1);

    // handle getting diagnostic info
    panId = ThreadStackMgrImpl().GetPanID();
    ThreadStackMgrImpl().GetNetworkKey(netKey);
    threadChannel = ThreadStackMgrImpl().GetChannel();
    GetDiagnosticDataProvider().GetCurrentHeapUsed(heapUsed);
    GetDiagnosticDataProvider().GetCurrentHeapFree(heapFree);

    if (conId != NULL)
    {
        PLAT_LOG("First Active Connection ID: %d", *((uint16_t *) conId));
    }

    AppoBLE().SendAppoBLEWriteRequest(conId, (ChipBleUUID *) diagnosticServiceUUID, (ChipBleUUID *) diagnosticService_HeapFreeUUID,
                                      (uint8_t *) &heapFree, sizeof(heapFree));

    AppoBLE().SendAppoBLEWriteRequest(conId, (ChipBleUUID *) diagnosticServiceUUID, (ChipBleUUID *) diagnosticService_HeapUsedUUID,
                                      (uint8_t *) &heapUsed, sizeof(heapUsed));

    AppoBLE().SendAppoBLEWriteRequest(conId, (ChipBleUUID *) diagnosticServiceUUID,
                                      (ChipBleUUID *) diagnosticService_ThreadNetKeyUUID, (uint8_t *) &netKey, sizeof(netKey));

    AppoBLE().SendAppoBLEWriteRequest(conId, (ChipBleUUID *) diagnosticServiceUUID,
                                      (ChipBleUUID *) diagnosticService_ThreadChannelUUID, (uint8_t *) &threadChannel,
                                      sizeof(threadChannel));

    AppoBLE().SendAppoBLEWriteRequest(conId, (ChipBleUUID *) diagnosticServiceUUID,
                                      (ChipBleUUID *) diagnosticService_ThreadPanIDUUID, (uint8_t *) &panId, sizeof(panId));
}

void throughput_calc(ThroughputRate_t * throughput_data)
{
    uint16_t instant_total = 0;
    for (uint16_t i = 0; i < throughput_data->message_count; i++)
    {
        instant_total += throughput_data->stored_bytes[i];
    }
    // reset message count for next calc period
    throughput_data->message_count = 0;
    // store instant rate and increment the index
    throughput_data->bytes_cb[throughput_data->bytes_cb_index] = instant_total;

    if (throughput_data->bytes_cb_index == (CB_SIZE - 1))
    {
        throughput_data->cbBufferFilled = TRUE;
        throughput_data->bytes_cb_index = 0;
    }
    else
    {
        throughput_data->bytes_cb_index++;
    }

    // calculate average rate
    uint16_t avg        = 0;
    uint8_t msg_samples = 0;
    // check if buffer is full or not
    if (throughput_data->cbBufferFilled)
    {
        for (int i = 0; i < CB_SIZE; i++)
        {
            avg += throughput_data->bytes_cb[i];
        }
        avg         = avg / CB_SIZE;
        msg_samples = CB_SIZE;
    }
    else
    {
        for (int i = 0; i < throughput_data->bytes_cb_index; i++)
        {
            avg += throughput_data->bytes_cb[i];
        }
        avg         = avg / (throughput_data->bytes_cb_index);
        msg_samples = throughput_data->bytes_cb_index;
    }
    avg = avg * 8;
    PLAT_LOG("Number of messages: %d", throughput_data->log_message_count);
    PLAT_LOG("average throughput rate (kb/s): %d.%d, over %d samples", (avg / 1000), (avg % 1000), msg_samples);
}
#endif